# У одной бабушки, когда та переписывается с внуком, постоянно залипает кнопка пробела.
# В итоге между словами получаются огромные расстояния. Внук не знает как это поправить в самом телефоне, поэтому обратился к вам за помощью.
# Пользователь вводит строку. Напишите программу, которая преобразовывает в этой строке все идущие подряд пробелы в один и выводит результат на экран.
# Пример:
# Введите текст: У       нас         пошёл                    снег    !
# Исправленный текст: У нас пошёл снег !
#
# my_string = input("Введите текст: ")
# my_str_list = my_string.split()
# new_str = ' '.join(my_str_list)
# print(f"Исправленный текст: {new_str}")
# ----------------------------------------------------------------------------------------------------------------------
